app/views/users/show.html.erb


  <%@user.avatars.each do |avatar|%>
---
SELECT "avatars".* FROM "avatars" WHERE "avatars"."user_id" = ?  [["user_id", 1]]