app/controllers/application_controller.rb

  def current_user
    if session[:user_id]
      @log_in_user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]