app/controllers/users_controller.rb

    def create
      @user = User.new(user_params)
       if @user.valid?
         @user.save
---
INSERT INTO "users" ("username", "password_digest", "name", "bio", "location", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def destroy
      @user = User.find(params[:id])
      @user.avatars.each do |avatar|
        avatar.destroy
      end
      @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "avatars".* FROM "avatars" WHERE "avatars"."user_id" = ?  [["user_id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]